window.siteProjectData = {
  hostedResearch: [
    {
      date: "2024.01–2026.12",
      text: "国家自然科学基金委员会，青年科学基金项目，地震-次生火灾作用下胶合木框架支撑结构损伤演化与性能评估，52308268，主持"
    },
    {
      date: "2023.04–2026.03",
      text: "上海市科学技术委员会，上海市“科技创新行动计划”启明星项目（扬帆专项），23YF1430900，震后损伤对木框架梁柱螺栓连接节点的抗火性能影响机理研究，主持"
    },
    {
      date: "2023.05–2026.04",
      text: "上海师范大学国家自然科学基金培育计划，基于 Johansen 屈服理论的胶合木损伤节点抗火模型和结构标准火灾场模型研究，主持"
    },
    {
      date: "2025.01–2026.01",
      text: "企事业单位委托课题，结构用工程竹标准火灾下燃烧性能测试，主持"
    },
    {
      date: "",
      text: "上海市高等教育人才揽蓄计划，上海市教育委员会"
    }
  ],
  participatedResearch: [
    {
      date: "2017.07–2020.12",
      text: "国家重点研发计划项目，2017YFC0703507，多层木结构及木混合结构体系研究及工程示范"
    },
    {
      date: "2021.07–2024.06",
      text: "上海市科技创新行动计划启明星项目（A类），钢木混合结构功能恢复机理与可恢复性设计方法"
    }
  ],
  hostedTeaching: [
    {
      date: "2025",
      text: "上海市教育委员会，上海市重点课程，《建筑材料》，主持"
    },
    {
      date: "2023.09–2025.09",
      text: "上海市教育委员会，上海高校青年教师培养资助计划重点推荐项目，课程思政改革要求下《木结构》课堂教学设计，主持"
    },
    {
      date: "2025.06–2026.06",
      text: "上海师范大学智慧课程建设，《建筑材料》，主持"
    },
    {
      date: "2024.01–2024.12",
      text: "上海师范大学 UGS 课题，小学古诗词跨学科学习实践研究，主持"
    },
    {
      date: "2026.01–2026.12",
      text: "上海师范大学 UGS 课题，五育融合背景下综合实践活动赋能劳动教育新样态的实践研究，主持"
    },
    {
      date: "2023.06–2025.05",
      text: "上海师范大学建筑工程学院课程建设项目，《自然科学史》一流课程建设，主持"
    },
    {
      date: "2024.11",
      text: "基础教育学习科技创新课程课题，星云木搭建课程项目，主持"
    }
  ],
  participatedTeaching: [
    {
      date: "2024.01–2024.12",
      text: "长三角教育发展研究院重大课题，推动科学教育创新发展研究，科研骨干"
    },
    {
      date: "",
      text: "教育部民族教育发展研究中心，民族地区中小学科学教育实践研究，项目骨干"
    }
  ]
};
